{
    "english": "الإنجليزية",
    "french": "الفرنسية",
    "german": "الألمانية",
    "arabic": "العربية",

    "About": "حول",
    "Experience": "الخبرة",
    "Projects": "المشاريع",
    "Skills": "المهارات",
    "Contact": "الاتصال",

    "Hi, I'm": "مرحبًا، أنا",
    "I am fullstack JavaScript developer": "أنا مطور برمجيات جافا سكريبت",
    "Web and Mobile Apps": "تطبيقات الويب والهواتف المحمولة",
    "Rafik Rahmi": "رفيق الراهمي",

    "Introduction": "مقدمة",
    "Overview": "نظرة عامة",
    "I'm a skilled software developer with experience in TypeScript and JavaScript, and expertise in frameworks like Reactjs, React-native, Node.js, and Next.js. I'm a quick learner and collaborate closely with clients to create efficient, scalable, and user-friendly solutions that solve real-world problems. Let's work together to bring your ideas to life!": "أنا مطور برامج ماهر لدي خبرة في TypeScript و JavaScript ، وأتقن أطر العمل مثل Reactjs و React-native و Node.js و Next.js. أنا متعلم سريع وأتعاون بشكل وثيق مع العملاء لإنشاء حلول فعالة وقابلة للتوسع وسهلة الاستخدام لحل المشكلات الواقعية. دعونا نعمل معًا لتحويل أفكارك إلى واقع!",
    "Reactjs Developer": "مطور Reactjs",
    "React-Native Developer": "مطور React-Native",
    "Nodejs Developer": "مطور Nodejs",
    "FullStack JS Developer": "مطور FullStack JS",

    "What I have done so far": "ما قمت به حتى الآن",
    "Work Experience": "الخبرة العملية",
    "March 2024 – present": "مارس 2024 – الحاضر",
    "July 2023 – January 2024": "يوليو 2023 – يناير 2024",

    "My work": "عملي",
    "Following projects showcases my skills and experience through real-world examples of my work. Each project is briefly described with links to code repositories and live demos in it. It reflects my ability to solve complex problems, work with different technologies, and manage projects effectively.": "تُظهر المشاريع التالية مهاراتي وخبرتي من خلال أمثلة حقيقية لعملي. يتم وصف كل مشروع باختصار مع روابط لمستودعات الشيفرة وعروض مباشرة. إنه يعكس قدرتي على حل المشكلات المعقدة، والعمل مع تقنيات مختلفة، وإدارة المشاريع بفعالية.",
    "Frontend Technologies": "تقنيات الواجهة الأمامية",
    "Programming Languages": "لغات البرمجة",
    "Backend Technologies": "تقنيات الواجهة الخلفية",
    "APIs & VCS Tools": "أدوات API و VCS",

    "Thank you. I will get back to you as soon as possible.": "شكرًا لك. سأعاود الاتصال بك في أقرب وقت ممكن.",
    "Ahh, something went wrong. Please try again.": "أوه، حدث خطأ ما. يرجى المحاولة مرة أخرى.",
    "Get in touch": "تواصل معنا",
    "Your Name": "اسمك",
    "What's your name?": "ما اسمك؟",
    "Your email": "بريدك الإلكتروني",
    "What's your web address?": "ما هو عنوان الويب الخاص بك؟",
    "Your Message": "رسالتك",
    "What you want to say?": "ماذا تريد أن تقول؟",
    "Sending...": "جارٍ الإرسال...",
    "Send": "إرسال",

    "A mobile app that links sellers, stores, users, and delivery services, enabling product browsing, purchasing, and efficient order fulfillment with real-time tracking and seamless communication between all parties.": "تطبيق موبايل يربط بين البائعين والمتاجر والمستخدمين وخدمات التوصيل، مما يمكّن من تصفح المنتجات، والشراء، وتنفيذ الطلبات بكفاءة مع تتبع في الوقت الحقيقي وتواصل سلس بين جميع الأطراف.",
    "A web-based platform for managing employee documents, vacations, salaries, and more, streamlining HR and workforce management tasks in one place. It includes real-time tracking and communication tools to enhance team productivity.": "منصة تعتمد على الويب لإدارة مستندات الموظفين والإجازات والرواتب والمزيد، مما يبسط مهام إدارة الموارد البشرية وإدارة القوى العاملة في مكان واحد. تشمل أدوات تتبع وتواصل في الوقت الحقيقي لتعزيز إنتاجية الفريق.",
    "A web-based platform that effectively demonstrates my skills and experience, featuring brief descriptions with links to code repositories and live demos, showcasing my problem-solving abilities and project management expertise.": "منصة تعتمد على الويب توضح مهاراتي وخبرتي بفعالية، مع أوصاف قصيرة تحتوي على روابط لمستودعات الكود وعروض حية، تظهر قدراتي على حل المشكلات وخبرتي في إدارة المشاريع.",
    "A web app that allows companies to create employee profiles and apply for job postings created by enterprises, streamlining the hiring process and facilitating connections between employers and potential hires in an efficient manner.": "تطبيق ويب يسمح للشركات بإنشاء ملفات تعريف للموظفين والتقدم لوظائف تم نشرها بواسطة الشركات، مما يبسط عملية التوظيف ويسهل الاتصالات بين أصحاب العمل والمرشحين المحتملين بشكل فعال.",
    "A web app that sells cakes and offers courses on how to make them, providing users with delicious treats and the skills to create their own confections. It features secure payments and engaging tutorials for a delightful baking experience.": "تطبيق ويب يبيع الكعك ويقدم دورات حول كيفية صنعها، موفراً للمستخدمين أطباق لذيذة والمهارات لإنشاء حلوياتهم الخاصة. يتميز بمدفوعات آمنة ودروس جذابة لتجربة خبز ممتعة.",
    "A task manager app that notifies users about their event dates, helping them stay organized and on schedule. It features intuitive task tracking, reminders, and a user-friendly interface for effective time management.": "تطبيق مدير مهام يُبلغ المستخدمين بتواريخ أحداثهم، مما يساعدهم على البقاء منظمين وفي الوقت المحدد. يتميز بتتبع المهام بشكل بديهي، وتذكيرات، وواجهة سهلة الاستخدام لإدارة الوقت بشكل فعال.",

     "Developing and maintaining web applications using React.js and other related technologies.": "تطوير وصيانة تطبيقات الويب باستخدام React.js وغيرها من التقنيات ذات الصلة.",
    "Collaborating with cross-functional teams to create high-quality products.": "التعاون مع فرق متعددة التخصصات لإنشاء منتجات عالية الجودة.",
    "Implementing responsive design and ensuring cross-browser compatibility.": "تنفيذ التصميم المستجيب وضمان التوافق عبر المتصفحات.",
    "Mentoring junior developers and conducting code reviews.": "توجيه المطورين المبتدئين وإجراء مراجعات للشفرة.",
    "Optimized application performance through code refactoring.": "تحسين أداء التطبيق من خلال إعادة هيكلة الشفرة.",
    "Collaborating with teams to drive product quality and innovation.": "التعاون مع الفرق لتعزيز جودة المنتج والابتكار.",
    "Ensuring cross-browser compatibility across various platforms.": "ضمان التوافق بين المتصفحات عبر منصات متعددة.",
    "Engaging in code reviews to foster a culture of continuous improvement.": "المشاركة في مراجعات الشفرة لتعزيز ثقافة التحسين المستمر.",
    "Collaborated remotely with a team in Poland to facilitate seamless project management.": "التعاون عن بُعد مع فريق في بولندا لتسهيل إدارة المشاريع بسلاسة.",
    "Enhanced expertise in the MERN stack through collaboration with junior developers.": "تعزيز الخبرة في مجموعة MERN من خلال التعاون مع المطورين المبتدئين."
}