{
    "english": "Anglais",
    "french": "Français",
    "german": "Allemand",
    "arabic": "Arabe",

    "About": "À propos",
    "Experience": "Expérience",
    "Projects": "Projets",
    "Skills": "Compétences",
    "Contact": "Contact",

    "Hi, I'm": "Salut, je suis",
    "I am fullstack JavaScript developer": "Je suis développeur JavaScript fullstack",
    "Web and Mobile Apps": "Applications Web et Mobiles",
    "Rafik Rahmi": "Rafik Rahmi",

    "Introduction": "Introduction",
    "Overview": "Aperçu",
    "I'm a skilled software developer with experience in TypeScript and JavaScript, and expertise in frameworks like Reactjs, React-native, Node.js, and Next.js. I'm a quick learner and collaborate closely with clients to create efficient, scalable, and user-friendly solutions that solve real-world problems. Let's work together to bring your ideas to life!": "Je suis un développeur de logiciels qualifié avec de l'expérience en TypeScript et JavaScript, et une expertise dans des frameworks comme Reactjs, React-native, Node.js, et Next.js. J'apprends vite et collabore étroitement avec les clients pour créer des solutions efficaces, évolutives et conviviales qui résolvent des problèmes du monde réel. Travaillons ensemble pour donner vie à vos idées!",
    "Reactjs Developer": "Développeur Reactjs",
    "React-Native Developer": "Développeur React-Native",
    "Nodejs Developer": "Développeur Nodejs",
    "FullStack JS Developer": "Développeur FullStack JS",

    "What I have done so far": "Ce que j'ai fait jusqu'à présent",
    "Work Experience": "Expérience Professionnelle",
    "March 2024 – present": "Mars 2024 – présent",
    "July 2023 – January 2024": "Juillet 2023 – Janvier 2024",

    "My work": "Mon travail",
    "Following projects showcases my skills and experience through real-world examples of my work. Each project is briefly described with links to code repositories and live demos in it. It reflects my ability to solve complex problems, work with different technologies, and manage projects effectively.": "Les projets suivants mettent en avant mes compétences et mon expérience à travers des exemples concrets de mon travail. Chaque projet est brièvement décrit avec des liens vers des dépôts de code et des démonstrations en direct. Cela reflète ma capacité à résoudre des problèmes complexes, à travailler avec différentes technologies et à gérer des projets de manière efficace.",
    "Frontend Technologies": "Technologies Frontend",
    "Programming Languages": "Langages de programmation",
    "Backend Technologies": "Technologies Backend",
    "APIs & VCS Tools": "Outils API et VCS",

    "Thank you. I will get back to you as soon as possible.": "Merci. Je vous répondrai dès que possible.",
    "Ahh, something went wrong. Please try again.": "Ahh, quelque chose s'est mal passé. Veuillez réessayer.",
    "Get in touch": "Contactez-moi",
    "Your Name": "Votre nom",
    "What's your name?": "Quel est votre nom ?",
    "Your email": "Votre e-mail",
    "What's your web address?": "Quelle est votre adresse web ?",
    "Your Message": "Votre message",
    "What you want to say?": "Que voulez-vous dire ?",
    "Sending...": "Envoi en cours...",
    "Send": "Envoyer",

    "A mobile app that links sellers, stores, users, and delivery services, enabling product browsing, purchasing, and efficient order fulfillment with real-time tracking and seamless communication between all parties.": "Une application mobile qui relie les vendeurs, les magasins, les utilisateurs et les services de livraison, permettant de parcourir les produits, d'acheter et d'assurer une exécution efficace des commandes avec un suivi en temps réel et une communication fluide entre toutes les parties.",
    "A web-based platform for managing employee documents, vacations, salaries, and more, streamlining HR and workforce management tasks in one place. It includes real-time tracking and communication tools to enhance team productivity.": "Une plateforme web pour la gestion des documents des employés, des vacances, des salaires, et plus encore, rationalisant les tâches de gestion des ressources humaines et de la main-d'œuvre au même endroit. Elle inclut des outils de suivi et de communication en temps réel pour améliorer la productivité de l'équipe.",
    "A web-based platform that effectively demonstrates my skills and experience, featuring brief descriptions with links to code repositories and live demos, showcasing my problem-solving abilities and project management expertise.": "Une plateforme web qui démontre efficacement mes compétences et mon expérience, avec de brèves descriptions et des liens vers des dépôts de code et des démos en direct, mettant en valeur mes capacités de résolution de problèmes et mon expertise en gestion de projet.",
    "A web app that allows companies to create employee profiles and apply for job postings created by enterprises, streamlining the hiring process and facilitating connections between employers and potential hires in an efficient manner.": "Une application web qui permet aux entreprises de créer des profils d'employés et de postuler à des offres d'emploi créées par des entreprises, rationalisant le processus de recrutement et facilitant les connexions entre employeurs et candidats potentiels de manière efficace.",
    "A web app that sells cakes and offers courses on how to make them, providing users with delicious treats and the skills to create their own confections. It features secure payments and engaging tutorials for a delightful baking experience.": "Une application web qui vend des gâteaux et propose des cours sur la manière de les réaliser, offrant aux utilisateurs des délices et les compétences pour créer leurs propres confiseries. Elle comprend des paiements sécurisés et des tutoriels engageants pour une expérience de pâtisserie délicieuse.",
    "A task manager app that notifies users about their event dates, helping them stay organized and on schedule. It features intuitive task tracking, reminders, and a user-friendly interface for effective time management.": "Une application de gestion des tâches qui notifie les utilisateurs des dates d'événements, les aidant à rester organisés et à respecter leur emploi du temps. Elle propose un suivi intuitif des tâches, des rappels et une interface conviviale pour une gestion efficace du temps.",

    "Developing and maintaining web applications using React.js and other related technologies.": "Développer et maintenir des applications web en utilisant React.js et d'autres technologies connexes.",
    "Collaborating with cross-functional teams to create high-quality products.": "Collaborer avec des équipes interfonctionnelles pour créer des produits de haute qualité.",
    "Implementing responsive design and ensuring cross-browser compatibility.": "Mettre en œuvre un design réactif et garantir la compatibilité entre les navigateurs.",
    "Mentoring junior developers and conducting code reviews.": "Encadrer les développeurs juniors et réaliser des revues de code.",
    "Optimized application performance through code refactoring.": "Optimisé la performance des applications grâce à la refactorisation du code.",
    "Collaborating with teams to drive product quality and innovation.": "Collaborer avec des équipes pour améliorer la qualité et l'innovation des produits.",
    "Ensuring cross-browser compatibility across various platforms.": "Assurer la compatibilité entre les navigateurs sur diverses plateformes.",
    "Engaging in code reviews to foster a culture of continuous improvement.": "Participer à des revues de code pour favoriser une culture d'amélioration continue.",
    "Collaborated remotely with a team in Poland to facilitate seamless project management.": "Collaboré à distance avec une équipe en Pologne pour faciliter la gestion de projet sans heurts.",
    "Enhanced expertise in the MERN stack through collaboration with junior developers.": "Renforcé l'expertise dans la pile MERN grâce à la collaboration avec des développeurs juniors."
}